app/views/groups/_group.html.erb

    <strong>Groupname:</strong>
    <%= group.groupname %>
---
SELECT "groups".* FROM "groups"