app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
---
          <div class="col-md-9 my-auto" style="color: white">
            <h4 class="mx-auto mb-0"> <%= group.groupname %> </h4>