app/views/users/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."groupname" = $1  [["groupname", "List Eaters"]]
---
    <% opponent = current_user.next_opponent %>
    <% groupname = current_user.group_name %>