app/controllers/games_controller.rb

INSERT INTO "games" ("hometeam", "opponent", "gamedate", "day", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE "games" SET "gamedate" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["gamedate", "2022-09-03 12:00:00"], ["updated_at", "2022-01-06 18:17:46.752276"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)