app/controllers/groups_controller.rb

INSERT INTO "groups" ("groupname", "member", "pulled", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["groupname", "TAMU vs Alabama"], ["member", "Jon"], ["pulled", true], ["created_at", "2022-01-07 01:43:01.381057"], ["updated_at", "2022-01-07 01:43:01.381057"]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "pulled" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["pulled", true], ["updated_at", "2022-01-06 18:07:53.396270"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)