app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Kareemh17@gmail.com"], ["LIMIT", 1]]
---
  def create
    session_params = params.permit(:authenticity_token, :email, :password, :commit)
    @user = User.find_by(email: session_params[:email])