app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "Kareemh17@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-02-11 02:15:45.539628"], ["updated_at", "2022-02-11 02:15:45.539628"]]